Revit 2024 API
PDFExportOptions.HideReferencePlane Property
 Whether to hide reference/work planes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public bool HideReferencePlane { get; set; }
Visual Basic
Public Property HideReferencePlane As Boolean
	Get
	Set
Visual C++
public:
property bool HideReferencePlane {
	bool get ();
	void set (bool value);
}
See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace